In [59]:
import pandas as pd
import numpy as np

In [61]:
import pandas as pd
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK', np.nan]})

In [62]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500  NaN

In [63]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', nan], dtype=object)

In [64]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [65]:
df_one['k1'].nunique()

3

In [97]:
df_one.query("col1 == col1.max()")

  k1  col1 col2
5  C   500  NaN

In [75]:
df_one.value_counts(normalize=True)

k1  col1  col2
B   300   WA      2
A   100   NY      1
    200   CA      1
C   400   AK      1
Name: count, dtype: int64

In [70]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500  NaN

In [9]:
df_one['NEW'] = df_one['col1'] * 10

In [10]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [11]:
def grab_first_letter(state):
    return state[0]

In [12]:
grab_first_letter('NY')

'N'

In [13]:
df_one['col2'].apply(grab_first_letter)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [14]:
df_one['first letter'] = df_one['col2'].apply(grab_first_letter)

In [15]:
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [16]:
df_one.drop('col2', axis=1)

  k1  col1   NEW first letter
0  A   100  1000            N
1  A   200  2000            C
2  B   300  3000            W
3  B   300  3000            W
4  C   400  4000            A
5  C   500  5000            N

In [17]:
df_one.transpose()

                 0     1     2     3     4     5
k1               A     A     B     B     C     C
col1           100   200   300   300   400   500
col2            NY    CA    WA    WA    AK    NV
NEW           1000  2000  3000  3000  4000  5000
first letter     N     C     W     W     A     N

In [18]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [19]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [20]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [21]:
my_map = {'A':1, 'B':2, 'C':3}

In [22]:
df_one['k1'].map(my_map)

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: int64

In [23]:
df_one['num'] = df_one['k1'].map(my_map)

In [24]:
df_one

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [25]:
df_one.max()

k1                 C
col1             500
col2              WA
NEW             5000
first letter       W
num                3
dtype: object

In [26]:
df_one.idxmax()

k1              4
col1            5
col2            2
NEW             5
first letter    2
num             4
dtype: int64

In [27]:
df_one['col1'].idxmax()

5

In [28]:
df_one['col1'].min()

100

In [29]:
df_one['col1'].idxmin()

0

In [30]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first letter', 'num'], dtype='object')

In [31]:
df_one.index

RangeIndex(start=0, stop=6, step=1)

In [32]:
col = 'c1 c2 c3 c4 c5 c6'.split()

In [33]:
df_one.columns = col

In [34]:
df_one

  c1   c2  c3    c4 c5  c6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [35]:
df_one.sort_values('c3')

  c1   c2  c3    c4 c5  c6
4  C  400  AK  4000  A   3
1  A  200  CA  2000  C   1
5  C  500  NV  5000  N   3
0  A  100  NY  1000  N   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2

In [36]:
df_one.sort_values('c3', ascending=False)

  c1   c2  c3    c4 c5  c6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [37]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [38]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [39]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [40]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [41]:
df_one['c1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [42]:
pd.get_dummies(df_one['c1'])

       A      B      C
0   True  False  False
1   True  False  False
2  False   True  False
3  False   True  False
4  False  False   True
5  False  False   True